# NumPy Arrays

In [1]:
my_list = [1,2,3]

In [2]:
import numpy as np

In [3]:
arr=np.array(my_list)

In [4]:
arr

array([1, 2, 3])

In [5]:
my_mat = [[1,2,3],[4,5,6],[7,8,9]]

In [6]:
np.array(my_mat)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [10]:
np.arange(0,11,2)

array([ 0,  2,  4,  6,  8, 10])

In [11]:
np.zeros(3)

array([0., 0., 0.])

In [14]:
np.zeros((2,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [15]:
np.ones((3,4))

array([[1., 1., 1., 1.],
       [1., 1., 1., 1.],
       [1., 1., 1., 1.]])

In [22]:
np.linspace(0,5,7)

array([0.        , 0.83333333, 1.66666667, 2.5       , 3.33333333,
       4.16666667, 5.        ])

In [23]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [24]:
np.random.rand(5)

array([0.46711178, 0.60230781, 0.5566091 , 0.54471918, 0.54718489])

In [25]:
np.random.rand(5,5)

array([[0.36152635, 0.99694065, 0.22310817, 0.48506854, 0.91570924],
       [0.56068343, 0.49348808, 0.05371654, 0.78649676, 0.10331531],
       [0.07962726, 0.86820099, 0.80395999, 0.49598919, 0.83251113],
       [0.44314545, 0.52751265, 0.24887084, 0.20701225, 0.24667565],
       [0.32521702, 0.52885641, 0.19537484, 0.02241253, 0.59446737]])

In [26]:
np.random.randn(2)

array([-0.17842545, -1.93564946])

In [27]:
np.random.randn(2,3)

array([[ 0.60978636,  1.38928182,  0.53635607],
       [-1.0997312 ,  0.24802767,  0.32973355]])

In [28]:
np.random.randint(1,100)

13

In [29]:
np.random.randint(1,100,5)

array([64, 29, 47, 25, 91])

In [30]:
arr = np.arange(25)

In [31]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24])

In [32]:
rnarr = np.random.randint(0,50,10)

In [33]:
rnarr

array([ 7, 35, 37, 22, 41,  5, 23,  3, 14, 11])

In [34]:
arr.reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [37]:
rnarr.max()

41

In [38]:
rnarr.min()

3

In [39]:
rnarr.argmax()

4

In [40]:
rnarr.argmin()

7

In [41]:
arr.shape

(25,)

In [42]:
arr = arr.reshape(5,5)

In [43]:
arr.shape

(5, 5)

In [44]:
arr.dtype

dtype('int32')

In [45]:
from numpy.random import randint

In [48]:
randint(2,10)

9

# Array indexing and selection

In [1]:
import numpy as np

In [2]:
arr = np.arange(0,11)

In [3]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [6]:
arr[8]

8

In [7]:
arr[1:5]

array([1, 2, 3, 4])

In [8]:
arr[0:5]

array([0, 1, 2, 3, 4])

In [9]:
arr[:6]

array([0, 1, 2, 3, 4, 5])

In [10]:
arr[5:]

array([ 5,  6,  7,  8,  9, 10])

In [11]:
arr[0:5]=100

In [12]:
arr

array([100, 100, 100, 100, 100,   5,   6,   7,   8,   9,  10])

In [13]:
arr=np.arange(0,11)

In [14]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [15]:
slice_of_arr = arr[0:6]

In [16]:
slice_of_arr

array([0, 1, 2, 3, 4, 5])

In [18]:
slice_of_arr[:]=99

In [19]:
slice_of_arr

array([99, 99, 99, 99, 99, 99])

In [20]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [21]:
arr_copy = arr.copy()

In [22]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [23]:
arr_copy

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [24]:
arr_copy[:]=100

In [25]:
arr_copy

array([100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100])

In [26]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [28]:
arr_2d=np.array([[5,10,15],[20,25,30],[35,40,45]])

In [29]:
arr_2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [30]:
arr_2d[0][0]

5

In [31]:
arr_2d[0]

array([ 5, 10, 15])

In [32]:
arr_2d[1]

array([20, 25, 30])

In [35]:
arr_2d[1,2]

30

In [36]:
arr_2d[2,2]

45

In [37]:
arr_2d[:2,1:]

array([[10, 15],
       [25, 30]])

In [38]:
arr_2d[:2]

array([[ 5, 10, 15],
       [20, 25, 30]])

In [40]:
arr_2d[:0,0:]

array([], shape=(0, 3), dtype=int32)

In [41]:
arr_2d[:0]

array([], shape=(0, 3), dtype=int32)

In [43]:
arr_2d[1:]

array([[20, 25, 30],
       [35, 40, 45]])

In [44]:
arr1 = np.arange(1,11)

In [45]:
arr1

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [48]:
bool_arr1 = arr1 > 5

In [49]:
bool_arr1

array([False, False, False, False, False,  True,  True,  True,  True,
        True])

In [51]:
arr1[bool_arr1]

array([ 6,  7,  8,  9, 10])

In [52]:
arr1[arr1>5]

array([ 6,  7,  8,  9, 10])

In [53]:
arr1[arr1<3]

array([1, 2])

In [54]:
arr1_2d = np.arange(50).reshape(5,10)

In [55]:
arr1_2d

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49]])

In [57]:
arr1_2d[1:3,3:5]

array([[13, 14],
       [23, 24]])

In [58]:
arr1_2d[3:4,6:8]

array([[36, 37]])

In [59]:
arr1_2d[3:,3:5]

array([[33, 34],
       [43, 44]])

In [60]:
arr1_2d[3:4,9:]

array([[39]])

In [61]:
arr1_2d[0:,6:8]

array([[ 6,  7],
       [16, 17],
       [26, 27],
       [36, 37],
       [46, 47]])

# NumPy Operations

In [62]:
import numpy as np

In [63]:
arr = np.arange(0,11)

In [64]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [65]:
arr + arr

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [66]:
arr - arr

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [67]:
arr*arr

array([  0,   1,   4,   9,  16,  25,  36,  49,  64,  81, 100])

In [68]:
arr + 100

array([100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110])

In [69]:
arr*100

array([   0,  100,  200,  300,  400,  500,  600,  700,  800,  900, 1000])

In [71]:
arr/arr

C:\Users\hsaid\anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [72]:
1/arr

C:\Users\hsaid\anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in true_divide
  """Entry point for launching an IPython kernel.

array([       inf, 1.        , 0.5       , 0.33333333, 0.25      ,
       0.2       , 0.16666667, 0.14285714, 0.125     , 0.11111111,
       0.1       ])

In [73]:
arr **2

array([  0,   1,   4,   9,  16,  25,  36,  49,  64,  81, 100], dtype=int32)

In [74]:
np.sqrt(arr)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ,
       3.16227766])

In [75]:
np.exp(arr)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03, 2.20264658e+04])

In [76]:
np.max(arr)

10

In [77]:
np.sin(arr)

array([ 0.        ,  0.84147098,  0.90929743,  0.14112001, -0.7568025 ,
       -0.95892427, -0.2794155 ,  0.6569866 ,  0.98935825,  0.41211849,
       -0.54402111])

In [78]:
np.log(arr)

C:\Users\hsaid\anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in log
  """Entry point for launching an IPython kernel.

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458,
       2.30258509])

# Pandas

In [83]:
import numpy as np

In [84]:
import pandas as pd

In [86]:
labels = ['a','b','c']
my_data=[10,20,30]
arr = np.array(my_data)
d={'a':10,'b':20,'c':30}

In [87]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [88]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [89]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [91]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [92]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [93]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [94]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [95]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [96]:
ser1 =pd.Series([1,2,3,4],['Usa','Ger','Ussr','Japan'])

In [105]:
ser1

Usa      1
Ger      2
Ussr     3
Japan    4
dtype: int64

In [106]:
ser2 = pd.Series([1,2,5,6],['Usa','Ger','Ussr','Italy'])

In [107]:
ser2

Usa      1
Ger      2
Ussr     5
Italy    6
dtype: int64

In [108]:
ser3 = pd.Series(labels)

In [109]:
ser3

0    a
1    b
2    c
dtype: object

In [110]:
ser3[0]

'a'

In [111]:
ser1+ser2

Ger      4.0
Italy    NaN
Japan    NaN
Usa      2.0
Ussr     8.0
dtype: float64

# Data Frames

In [4]:
import numpy as np 
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
 df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [13]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [14]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [15]:
df['new'] = df['W'] + df['Y']

In [16]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('new',axis=1,inplace=True)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [20]:
df.shape

(5, 4)

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
C  0.528813  0.740122
D -0.933237 -0.758872
E  2.605967  1.978757

In [23]:
#Rows

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [26]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [27]:
df.loc['B','Y']

-0.8480769834036315

In [28]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [29]:
str1 = 'Hello today is thursday and we have second lecture with our Commander'

In [30]:
def even(string):
    mylist = []
    my_list=list(string.split(' '))
    for i,word in enumerate(my_list):
        if i%2==0:
            mylist.append(word+'_')
    xx="".join([x for x in mylist])
    xx = xx[:-1]
    return(xx)

In [31]:
even(str1)

'Hello_is_and_have_lecture_our'

In [32]:
def check(string):
    my_list=list(string.split(' '))
    mlist=[]
    list1 = ['t','r','l']
    for i in my_list:
        if i.startswith(tuple(list1)):
            mlist.append(i)
    return(mlist)

In [33]:
check(str1)

['today', 'thursday', 'lecture']

In [34]:
def zipreverse(str2):
    mylist=str2.split(' ')
    my_list = mylist[::-1]
    newlist= list(zip(mylist,my_list))
    return newlist

In [35]:
zipreverse(str1)

[('Hello', 'Commander'),
 ('today', 'our'),
 ('is', 'with'),
 ('thursday', 'lecture'),
 ('and', 'second'),
 ('we', 'have'),
 ('have', 'we'),
 ('second', 'and'),
 ('lecture', 'thursday'),
 ('with', 'is'),
 ('our', 'today'),
 ('Commander', 'Hello')]

In [36]:
import numpy as np
import pandas as pd

aws hesap acilacak
est hesap acilacak sonra baglama islemleri yapilacak

# Conditional Selection

In [37]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [40]:
booldf=df>0

In [41]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [45]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
resultdf = df[df['W']>0]

In [49]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [50]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [54]:
boolser=df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [56]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [67]:
newind = 'Ca ny wy or co'.split()

In [68]:
newind

['Ca', 'ny', 'wy', 'or', 'co']

In [69]:
df['States']=newind

In [70]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     Ca
B  0.651118 -0.319318 -0.848077  0.605965     ny
C -2.018168  0.740122  0.528813 -0.589001     wy
D  0.188695 -0.758872 -0.933237  0.955057     or
E  0.190794  1.978757  2.605967  0.683509     co

In [86]:
df.set_index('States')

KeyError: "None of ['States'] are in the columns"

In [89]:
df.reset_index(inplace=True)

In [90]:
df

  States         W         X         Y         Z
0     Ca  2.706850  0.628133  0.907969  0.503826
1     ny  0.651118 -0.319318 -0.848077  0.605965
2     wy -2.018168  0.740122  0.528813 -0.589001
3     or  0.188695 -0.758872 -0.933237  0.955057
4     co  0.190794  1.978757  2.605967  0.683509

In [91]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [96]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [98]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [100]:
df.index.names=['Groups','Nums']

In [101]:
df

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [104]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [105]:
df.loc['G1'].loc[3]['A']

-0.13484072060601238

In [106]:
df.loc['G1']

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [107]:
df.xs('G1')

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [108]:
df.xs(1,level='Nums')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [110]:
df

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

# Missing Data

In [111]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [112]:
df = pd.DataFrame(d)

In [113]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [116]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [119]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [120]:
df.fillna(value='Fill value')

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [123]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [124]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [125]:
df=pd.DataFrame(data)

In [126]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [128]:
byComp= df.groupby('Company')

In [129]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [130]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [132]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [133]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [134]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [135]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [136]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [141]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Operations

In [142]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [146]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [145]:
df['col2'].nunique()

3

In [149]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [152]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [153]:
def times2(x):
    return x*2

In [155]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [156]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [160]:
df['col2'].apply(lambda x : x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [161]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [162]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [163]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [164]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [165]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [166]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [167]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [168]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [169]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [171]:
df.pivot_table(values= 'D',index= ['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [11]:
import pandas as pd

In [12]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
df = pd.read_csv('example')

In [14]:
df.to_csv('My_output',index=False)

In [15]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

In [18]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [19]:
type(data)

list

In [20]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [21]:
from sqlalchemy import create_engine

In [22]:
engine = create_engine('sqlite:///:memory:')

In [23]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
df.to_sql('my_table',engine)

In [25]:
sqldf = pd.read_sql('my_table',con=engine)

In [26]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15